In [1]:
# Import libraries

import pandas as pd
import numpy as np
import os

In [2]:
# Create a path
path = r'C:\Users\pinto\OneDrive\Documenti\1-2024-Instacart Basket Analysis'

In [3]:
# Import customers.csv
df_customers = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'), index_col = False)

# Data wrangling

In [4]:
# Check dataframe
df_customers.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [5]:
# Rename "Surnam" column in "Surname" column for clarity
df_customers.rename(columns = {'Surnam' : 'Surname'}, inplace = True)

In [6]:
# Rename "n_dependants" column in "number_of_dependants" column for clarity
df_customers.rename(columns = {'n_dependants' : 'number_of_dependants'}, inplace = True)

In [7]:
# Rename "fam_status" column in "family_status" column for clarity
df_customers.rename(columns = {'fam_status' : 'family_status'}, inplace = True)

In [8]:
# Rename "STATE" column in "State" column for uniformity
df_customers.rename(columns = {'STATE' : 'State'}, inplace = True)

In [9]:
# Check changes
df_customers.head()

,user_id,First Name,Surname,Gender,State,Age,date_joined,number_of_dependants,family_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [10]:
# Check data types
df_customers.describe()

             user_id            Age  number_of_dependants         income
count  206209.000000  206209.000000         206209.000000  206209.000000
mean   103105.000000      49.501646              1.499823   94632.852548
std     59527.555167      18.480962              1.118433   42473.786988
min         1.000000      18.000000              0.000000   25903.000000
25%     51553.000000      33.000000              0.000000   59874.000000
50%    103105.000000      49.000000              1.000000   93547.000000
75%    154657.000000      66.000000              3.000000  124244.000000
max    206209.000000      81.000000              3.000000  593901.000000

In [11]:
df_customers['user_id'].dtype

dtype('int64')

In [12]:
# Change data type for "user_id" from integer to string value
df_customers['user_id'] = df_customers['user_id'].astype('str')

In [13]:
# Check changes
df_customers['user_id'].dtype

dtype('O')

# Data quality and consistency checks

In [14]:
# Check for mixed types in the dataframe 
for col in df_customers.columns.tolist():
  weird = (df_customers[[col]].map(type) != df_customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_customers[weird]) > 0:
    print (col)

First Name

In [15]:
# Convert "First Name" column from mixed one to string
df_customers['First Name'] = df_customers['First Name'].astype('str')

In [16]:
# Check if any mixed data types remained
for col in df_customers.columns.tolist():
  weird = (df_customers[[col]].map(type) != df_customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_customers[weird]) > 0:
    print (col)

In [17]:
# Look for missing observations
df_customers.isnull().sum()

user_id                 0
First Name              0
Surname                 0
Gender                  0
State                   0
Age                     0
date_joined             0
number_of_dependants    0
family_status           0
income                  0
dtype: int64

In [18]:
# There are no missing values in the df_customers dataframe

In [19]:
# Look for duplicates in the df_customers dataframe
df_dups_customers = df_customers[df_customers.duplicated()]

In [20]:
df_dups_customers

Empty DataFrame
Columns: [user_id, First Name, Surname, Gender, State, Age, date_joined, number_of_dependants, family_status, income]
Index: []

In [21]:
# There are no full duplicates in the df_customers dataframe

# Combine df_customers dataframe with the rest of Instacart data

In [22]:
# Import ords_prods_grouped.pkl
ords_prods_grouped = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'ords_prods_grouped.pkl'))

In [23]:
# Check the output
ords_prods_grouped.shape

(32434212, 28)

In [24]:
# Change data type for "user_id" from integer to string value in the ords_prods_grouped dataframe for uniformity
ords_prods_grouped['user_id'] = ords_prods_grouped['user_id'].astype('str')

In [26]:
# Merge ords_prods_grouped dataframe with df_customers dataframe
df_instacart = ords_prods_grouped.merge(df_customers, on='user_id', suffixes=('_ords_prods', '_customers'), indicator='exists')

In [27]:
# Check the output
df_instacart.head()

,Unnamed: 0.1,Unnamed: 0_ords_prods,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order,product_id,...,First Name,Surname,Gender,State,Age,date_joined,number_of_dependants,family_status,income,exists
0,0,0,2539329,1,prior,1,2,8,NaN,196,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
1,1,1,2398795,1,prior,2,3,7,15.0,196,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
2,2,2,473747,1,prior,3,3,12,21.0,196,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
3,3,3,2254736,1,prior,4,4,7,29.0,196,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
4,4,4,431534,1,prior,5,4,15,28.0,196,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both

In [28]:
# Check for full match or not
df_instacart['_merge'].value_counts()

_merge
both          32434212
left_only            0
right_only           0
Name: count, dtype: int64

In [29]:
# Export data to pkl

df_instacart.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'instacart_data.pkl'))